<?php

declare(strict_types=1);

return [
    'title' => 'โปรไฟล์',

    'information' => [
        'title' => 'ข้อมูลโปรไฟล์',
        'description' => 'อัปเดตข้อมูลโปรไฟล์และที่อยู่อีเมลที่นี่ค่ะ~',
        'label-name' => 'ชื่อเล่น',
        'label-email' => 'อีเมล',
        'unverified' => 'อีเมลของคุณยังไม่ได้รับการยืนยันเลย!',
        'resend' => 'คลิกที่นี่เพื่อส่งลิ้งยืนยันไปยังอีเมลนะคะ~',
        'send' => 'ลิ้งยืนยันได้ถูกส่งไปที่อีเมลของคุณแล้วค่ะ! รีบไปเช็กดูนะ!',
        'save' => 'บันทึก',
        'saved' => 'บันทึกสำเร็จ!',
    ],

    'password' => [
        'title' => 'อัปเดตรหัสผ่าน',
        'description' => 'ตรวจสอบให้แน่ใจว่าใช้รหัสผ่านที่ยาวและคาดเดาได้ยากเพื่อความปลอดภัยนะคะ',
        'label-current-password' => 'รหัสผ่านปัจจุบัน',
        'label-new-password' => 'รหัสผ่านใหม่',
        'label-confirm-password' => 'ยืนยันรหัสผ่าน',
        'save' => 'บันทึก',
        'saved' => 'บันทึกสำเร็จ!',
    ],

    'delete' => [
        'title' => 'ลบบัญชีผู้ใช้',
        'description' => 'เมื่อบัญชีถูกลบแล้ว ทรัพยากรและข้อมูลทั้งหมดจะถูกลบออกอย่างถาวร ก่อนที่จะลบบัญชี โปรดดาวน์โหลดข้อมูลที่ต้องการเก็บไว้ให้เรียบร้อยนะคะ',
        'delete' => 'ลบบัญชีผู้ใช้',
        'confirm-title' => 'แน่ใจเหรอคะต้องการลบบัญชี?',
        'confirm-description' => 'ถ้าลบไปแล้ว ทุกอย่างจะหายไปตลอดนะคะ~ ขอให้คิดให้ดีอีกรอบก่อนตัดสินใจนะ!',
        'cancel' => 'ยกเลิก',
        'input-password' => 'รหัสผ่าน',
    ],
];
